10/data/attachments/ce46d32cce257e54.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Shannon_fight_Friend_95566_1</nif:username>
            <nif:friendToBeRequested>soap_friends_dc85437c-9bba-43d5-9f74-b4dffd5b443a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>